"""Дано некоторое число:
12345
Выведите в консоль все его символы с конца.
Метод среза
"""
nu = 12345
s = str(nu)
print(s[::-1])