"""Дана строка:

'abcdef'
Получите каждый второй символ этой строки:

'ace'
Метод простого среза
"""


s = 'abcdef'
print(s[::2])