"""
Дано число. Выведите количество цифр в этом числе.
"""
number = input('Введите число:\n')
print(len(number))