"""
Дано число. Выведите в консоль первую цифру этого числа.
"""
number = int(input("Введите число"))
print(str(number)[0])