"""
Дано число. Выведите в консоль последнюю цифру этого числа.
"""
number = int(input("Введите число"))
print(str(number)[-1])