"""
Дан список:

[1, 2, 3, 4, 5, 6]
Получите из него следующий срез:

[1, 2, 3]
"""
list = [1,2,3,4,5,6]
print(list[0:3])