"""
Дана некоторая строка:

'abcde'
Получите список ее символов:

['a', 'b', 'c', 'd', 'e']
"""
my_str = 'abcde'
print(list(my_str))