"""
Дан список:

[1, 2, 3, 4, 5, 6]
Получите из него следующий срез:

[3, 4, 5]
"""
mylist = [1,2,3,4,5,6]
srez = mylist[2:5]
print(srez)