"""
Выведите в консоль все целые числа от -100 до 0.
"""
x = 100
while x > 0:
    x -= 1
    print(-x)