"""
Выведите в консоль все целые числа от 1 до 100.
"""
x = 1
while x < 100:
    print(x)
    x += 1
