"""
Дан список:

[1, 2, 3, 4, 5, 6]
Получите из него два последних элемента:

[5, 6]
Срез от предпоследнего элемента до конца списка (последние 2)
"""
my_list = [1, 2, 3, 4, 5, 6]
print(my_list)
result = my_list[-2:]
print(result)  # [5, 6]
