"""
Дана некоторая строка:

'abcdeabc'
Получите сет ее символов:

{'a', 'b', 'c', 'd', 'e'}
Сеты выводятся неупорядоченно
"""
my_string = 'abcdeabc'
print(set(my_string))