"""
Выведите в консоль все целые числа от 100 до 1.
"""
x = 100
while x > 0:
    print(x)
    x -= 1