"""
Найдите сумму всех целых чисел от 1 до 100.
"""
total = sum(range(1,101))
print(total)