"""
Найдите сумму всех целых нечетных чисел в промежутке от 1 до 100.
"""
print(sum(range(1,101,2)))