"""
Дан список:

[1, 2, 3, 4, 5, 6]
Получите из него каждый второй элемент:

[1, 3, 5]
"""
my_list = [1, 2, 3, 4, 5, 6]
print(my_list)
result = my_list[::2]  # начинаем с начала, до конца, шаг 2
print(result)  # [1, 3, 5]