"""
Найдите сумму всех целых четных чисел в промежутке от 1 до 100.
"""
print(sum(range(2,101,2)))