"""
Дан список с числами:

[1, 2, 3, 4, 5]
Найдите сумму элементов этого списка.
Найдём функцией sum
"""
l = [1, 2, 3, 4, 5]
s =sum(l)
print(s)