"""
Дан словарь:

{
	'a': 1,
	'b': 2,
	'c': 3,
	'd': 4,
}
Найдите сумму элементов этого словаря.

С помощью функции sum()
"""
slovar ={
	'a': 1,
	'b': 2,
	'c': 3,
	'd': 4,
}
print(sum(slovar.values()))