"""
Дано некоторое число:

12345
Переверните его:

54321
Сделаем с помощью среза
"""
nu = 12345
s = str(nu)
print(int(s[::-1]))