"""
Дана строка:

'abcde'
Получите список букв этой строки.
С помощью цикла перебора
"""
s = 'abcde'
l=[]
for char in s:
    l.append(char)
print(l)