"""
Дано некоторое число:

12345
Получите список цифр этого числа.
Сделаем с помощью функции list()
"""
nu = 12345
l = list(str(nu))
print(l)