"""
Дана строка:

'abcde'
Получите список букв этой строки.
C помощью функции list()
"""
s = 'abcde'
l = list(s)
print(l)