"""
Дана строка:

'abcdef'
Получите первых три символа этой строки:

'abc'
Метод среза
"""
s = 'abcdef'
print(s[0:3])