"""
Дан список с числами:

[1, 2, 3, 4, 5, 6]
Увеличьте каждое число из списка на 10 процентов.
"""
numbers = [1, 2, 3, 4, 5, 6]
result = [x + x * 0.1 for x in numbers]
print(result)  # [1.1, 2.2, 3.3, 4.4, 5.5, 6.6]