"""
Дан кортеж с числами:

(1, 2, 3, 4, 5)
Найдите сумму элементов этого кортежа.
Операция с кортежем
"""
my_tuple = (1, 2, 3, 4, 5)
print(sum(my_tuple))