"""
Дана строка:

'abcdef'
Получите три последних символа этой строки:

'def'
Метод среза
"""
s = "abcdef"
print(s[-3:])